Repository: partio-scout/fj16-web
Catalog: sites/all/modules/custom/fj16_job_ads/translations/*.po
Languages: sv

source: Further information
sv: Mer information

source: Position level
sv: Typ av uppdrag

source: Requirements
sv: Krav

source: Section
sv: Avdelning

source: Title of the position
sv: Namn av uppdrag

source: Open staff positions
sv: Lediga uppdrag

source: lisää
sv: mer

source: Filter positions
sv: Filtrera uppdrag

source: Show all
sv: Visa allt

source: <p>No positions to show.</p>
sv: <p>Inga uppdrag att söka.</p>

source: Department
sv: Avdelning

source: Page
sv: Sida

source: more
sv: mera

source: Apply for position
sv: Sök till uppdrag

source: The applicants will be informed personally about the recruitment decision.
sv: De sökande kontaktas personligen när valen har gjorts.

source: Name
sv: Namn

source: Email
sv: E-post

source: Phone number
sv: Telefon

source: Country and NSO/NSA/MO
sv: Kår och distrikt

source: Current scouting positions
sv: Dina nuvarande ansvarsuppdrag

source: Why are you applying for this position?
sv: Varför söker du till detta uppdrag?

source: Why would you be good in this position? What useful scouting experience do you have?
sv: Varför borde vi välja dig? Vilka nyttiga färdigheter, kunskaper och erfarenhet har du?

source: Other relevant experience
sv: Annan kompetens

source: Additional information
sv: Ytterlig information

source: This can be e.g. a link to an attachment for your application.
sv: Kan vara t.ex. en länk till bilagor.

source: Send application
sv: Skicka ansökan

source: Please enter a valid email address.
sv: E-postadressen är inte giltig.

source: Welcome to Roihu staff! Your application for the position has been received. We are presently in the process of reviewing each applicants resume. We will contact you after deadline.
sv: Fint och välkommen med! Din ansökan har kommit fram och delgetts vidare. Vi tar kontakt efter att ansökningstiden har gått ut.

source: Your application was not saved due to a technical problem. Please try again later.
sv: Din anmälan registrerades inte på grund av tekniska problem. Var vänlig och sök på nytt senare.

source: Position type
sv: Typ av uppdrag

source: Apply by
sv: Ansökningstiden går ut

source: Director
sv: Direktör

source: Manager
sv: Chef

source: Team leader
sv: Mästare

source: Subteam leader
sv: Bas

source: IST
sv: Donare

source: Other
sv: Annan

source: Experience
sv: Upplevelse

source: Education
sv: Fostran

source: Resource
sv: Resurs

source: Co-operation
sv: Samarbete

source: Sending...
sv: Skickas…
